БухЭксп/Reports/CW_ОтчетПоКассе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ОтчетПоКассе</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в валюте кассы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперацийДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперацийДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщикуПоПриобретениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/CW_ОтчетПоКассе/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция СформироватьОтчет(Результат=Неопределено, ДанныеРасшифровки = Неопределено) Экспорт
	
	Если Результат=Неопределено Тогда
		Результат = Новый ТабличныйДокумент;
	КонецЕсли;
	
	Результат.АвтоМасштаб = Истина;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// ---------------------------------------------------------------------------- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток КАК СальдоНачальное,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.СуммаПриход КАК Приход,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.СуммаРасход КАК Расход,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток КАК СальдоКонечное,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Регистратор.ВидОперации КАК ВидОперации,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Регистратор КАК Регистратор,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Регистратор.НомерДокумента КАК НомерДокумента,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Регистратор.ДатаДокумента КАК ДатаДокумента,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Регистратор.Дата КАК Дата,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Регистратор.ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Регистратор.НазначениеПлатежа КАК НазначениеПлатежа
	               |ИЗ
	               |	РегистрНакопления.CW_ДенежныеСредства.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			Касса = &Касса
	               |				И Валюта = &Валюта) КАК CW_ДенежныеСредстваОстаткиИОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Регистратор.МоментВремени";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.УстановитьПараметр("Валюта", Касса.Валюта );
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	СальдоНачальное = 0;
	СальдоКонечное = 0;
	ВсегоПриход = 0;
	ВсегоРасход = 0;
	Если (ТЗ.Количество() <> 0) Тогда
		
		_сф.к_УдалитьЭлементыПоОтбору(ТЗ,Новый Структура("Регистратор",Неопределено));
		
		СальдоНачальное = _сф.к_ПервыйЭлемент(ТЗ).СальдоНачальное;
		СальдоКонечное = _сф.к_ПоследнийЭлемент(ТЗ).СальдоКонечное;
		ВсегоПриход = _сф.Итог(ТЗ,"Приход");
		ВсегоРасход = _сф.Итог(ТЗ,"Расход");
		
	КонецЕсли; 
	
	
	// ---------------------------------------------------------------------------- 
	
	Макет = ПолучитьМакет("ОтчетПоКассе");
	
	ТД = Новый ТабличныйДокумент;
	ТД.АвтоМасштаб = Истина;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Текст = "Период: "+Формат(НачалоПериода, "ДЛФ=Д")+?(КонецПериода=Дата(1,1,1),Неопределено," - "+Формат(КонецПериода, "ДЛФ=Д"))+Символы.ПС+"Касса: "+Строка(Касса);
	ТД.Вывести(Область);
	
	// --- 
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Валюта = Строка(Касса.Валюта);
	ТД.Вывести(Область);
	
	// --- 
	
	Область = Макет.ПолучитьОбласть("СальдоНачальное");
	Область.Параметры.НачПериода= Формат(НачалоПериода,"ДФ=dd.MM.yyyy");
	Область.Параметры.Сальдо = СальдоНачальное;
	ТД.Вывести(Область);
	
	// --- 
	
	Область = Макет.ПолучитьОбласть("СтрокаОборота");
	Для каждого Стр Из ТЗ Цикл
		
		Если (Стр.Регистратор=Неопределено) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Область.Параметры.Документ = Стр.Регистратор;
		Область.Параметры.Дата = Стр.Дата;
		// --- 
		СтрокаСодержания = "";
		// --- 
		
		Представление = СокрЛП(Стр.ПредставлениеДокумента);
		ЕстьПредставление = ЗначениеЗаполнено(Представление);
		Назначение = СокрЛП(Стр.НазначениеПлатежа);
		ЕстьНазначение = ЗначениеЗаполнено(Назначение);
		// --- 
		Если (Стр.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПоступлениеОтПокупателя) Тогда
			
			СтрокаСодержания = "Получено от """+Строка(Стр.Регистратор.Контрагент)+""""+?(ЕстьПредставление," по "+Представление,"")+?(ЕстьНазначение," ("+Назначение+")","");
			
		ИначеЕсли (Стр.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщику) Тогда 
			
			 СтрокаСодержания = "Выдано """+Строка(Стр.Регистратор.Контрагент)+""""+?(ЕстьПредставление," по "+Представление,"")+?(ЕстьНазначение," ("+Назначение+")","");
			 
		ИначеЕсли (Стр.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПеремещениеВДругуюКассу) Тогда 
			
			 СтрокаСодержания = "Передано в """+Строка(Стр.Регистратор.КассаПоступления)+""""+?(ЕстьПредставление," по "+Представление,"")+?(ЕстьНазначение," ("+Назначение+")","");
			 
		ИначеЕсли (Стр.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПрочиеСписания) Тогда 
			
			 СтрокаСодержания = "Списано"+?(ЕстьПредставление," по "+Представление,"")+?(ЕстьНазначение," ("+Назначение+")","");
			 
		ИначеЕсли (Стр.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПрочиеПоступления) Тогда 
			
			 СтрокаСодержания = "Получено"+?(ЕстьПредставление," по "+Представление,"")+?(ЕстьНазначение," ("+Назначение+")","");
			 
		КонецЕсли; 
		Область.Параметры.Содержание = СтрокаСодержания;
		// --- 
		Область.Параметры.Приход = Стр.Приход;
		Область.Параметры.Расход = Стр.Расход; 
		
		ТД.Вывести(Область);
		
	КонецЦикла; 
	
	
	// --- 
	
	Область = Макет.ПолучитьОбласть("Итог");
	Область.Параметры.Приход = ВсегоПриход;
	Область.Параметры.Расход = ВсегоРасход;
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("СальдоКонечное");
	Область.Параметры.КонПериода= Формат(КонецПериода,"ДФ=dd.MM.yyyy");
	Область.Параметры.Сальдо = СальдоКонечное;
	ТД.Вывести(Область);
	
	// --- 
	
	Результат.Вывести(ТД);
	
	// ---------------------------------------------------------------------------- 
	
КонецФункции
	

#КонецЕсли
